["Draft version August 22, 2025\nTypeset using LATEX default style in AASTeX631\nUsing gravitational wave dark sirens to choose between host galaxy weighting models\nZhuotao Li,1 Rachel Gray,1 and Ik Siong Heng1\n1SUPA, University of Glasgow\nGlasgow, G12 8QQ, United Kingdom\nABSTRACT\nBinary black hole (BBH) mergers, an important source of gravitational-waves (GWs), are assumed\nto be hosted in galaxies. The probability of a galaxy to host a BBH is related to its properties, for\nexample stellar mass and star formation rate. These properties can be estimated from observables,\nsuch as the luminosity in certain observation bands. We refer to this description of host galaxy\nproperties as host galaxy weighting models. However, the host galaxy weighting model for BBHs has\nyet to be accurately determined. Population synthesis has provided a variety of host galaxy weighting\nmodels. Here we investigate whether it is possible to distinguish different host galaxy weighting\nmodels using a data driven approach. We use the GW cosmo", "e whether it is possible to distinguish different host galaxy weighting\nmodels using a data driven approach. We use the GW cosmology tool gwcosmo with a simulated\nLIGO-Virgo-KAGRA (LVK) fifth observing run (O5)-like observing scenario. We also construct a\nmock spectroscopic galaxy catalogue from MICECATv2. Our analysis compares the Bayes factors\namong three simple luminosity weighting models, r-band, g-band, and uniform weighting. The Bayes\nfactors among different host galaxy weighting models show a minor preference for the true model for\na ∼200-detection case, and a decisive preference for the true model over the uniform model for a\n∼1000-detection case, which is strongly driven by a small number of well-localised events.\n1. INTRODUCTION\nBBHs account for the majority of GWs detected to date. They are generally assumed to be hosted in galaxies.\nHowever, it is believed that some galaxies are more likely to host BBHs than others based on their galaxy properties,\ne.g. massive galaxies are believed to be more lik", "ies are more likely to host BBHs than others based on their galaxy properties,\ne.g. massive galaxies are believed to be more likely to host BBHs compared to low-mass galaxies in general.\nSo far, there have been many studies that have come to the conclusion that certain types of galaxies should have a\nhigher likelihood to host BBHs. These studies estimate the BBH merger rate of galaxies by simulating BBH formation\nchannels (isolated or dynamical) in the galaxies, and the BBH formation channels will be related to the host galaxy\nproperties. (We refer to this description of the distribution of galaxy properties for host galaxies as \"host galaxy\nweighting model\" in the following.) For example, Rauf et al. (2023) simulated the binary population synthesis in the\ngalaxies from a mock universe, and found that metal-rich and massive galaxies with star formation rate (SFR) higher\nthan 1M⊙/yr−1 had higher BBH merger rate. Another example, Neijssel et al. (2019), focused more on the impact\nof metallicity-specific star fo", " had higher BBH merger rate. Another example, Neijssel et al. (2019), focused more on the impact\nof metallicity-specific star formation rate on the compact binary coalescence (CBC) merger rate of the host galaxies.\nOther attempts to constrain the relationship between merger rate and galaxy intrinsic properties include Santoliquido\net al. (2021); Broekgaarden et al. (2022); Srinivasan et al. (2023); Chruślińska (2024) etc., all based on similar ideas\nthat we can use BBH formation channels to estimate the host galaxy weighting models. Similar studies exist for binary\nneutron star (BNS) as well, for example Rasio & Shapiro (1992); Tutukov & YungelSon (1993); Portegies Zwart &\nYungelson (1998); Claire et al. (2019); Andrews & Mandel (2019); Adhikari et al. (2020), etc.\nFurther more, the merger rate of galaxies can be linked to the observables as indicators for galaxy properties. These\nintrinsic galaxy properties, e.g. stellar mass, SFR, metallicity, etc., determine the observables including luminosity of\ncertain ", "trinsic galaxy properties, e.g. stellar mass, SFR, metallicity, etc., determine the observables including luminosity of\ncertain bands,Hα lines, colour, etc. There have been many studies on galaxy property indicators, e.g. Calzetti (2013);\nMobasher et al. (2015) discuss the indicators of SFR and stellar mass. However, the relationship between indicators\nand galaxy properties is a very complicated issue, so for simplicity it is easier to first consider the direct relationship\nz.li.13@research.gla.ac.uk\narXiv:2508.15574v1  [astro-ph.CO]  21 Aug 2025\n2\nbetween merger rate and observables without galaxy properties as intermediate. For example, Mukherjee & Dizgah\n(2022) directly proposed to use the emission lines of galaxies to constrain the delay time function of BBHs. This is\nwhat we will be doing in this paper.\nAll of the studies mentioned above try to constrain the host galaxy weighting models based on BBH formation\nchannels. However, we can also approach the problem of constraining host galaxy weighting model ", "g models based on BBH formation\nchannels. However, we can also approach the problem of constraining host galaxy weighting model in a data-driven\nmanner, i.e. starting from BBH GW data and galaxy catalogue data. Currently, there has been an attempt by\nVijaykumar et al. (2024) to constrain the host galaxy weighting model from the redshift evolution of the BBH merger\nrate using data from Abbott et al. (2023a). To be more specific, Vijaykumar et al. (2024) used universe simulation\nto test what kind of host galaxy weighting model is needed in order to have a redshift distribution of BBH events\nobtained from data under the assumption that the true weighting model is a combination of stellar mass and star\nformation rate. There are also attempts from Dehghani et al. (2025); Hosseini et al. (2025) to explore the difference\nbetween the overall matter distribution and BBH distribution under different host galaxy weighting models in order\nto shed light on this problem from a large-scale structure perspective. Compared to", "ferent host galaxy weighting models in order\nto shed light on this problem from a large-scale structure perspective. Compared to these studies, however, we would\nlike to focus more on how the localisation of individual BBH GW events with a galaxy catalogue can help to constrain\nthe host galaxy weighting model.\nUnderstanding the host galaxy weighting model is also very useful for many researches in GW astronomy, for instance\nGW cosmology and BBH population studies. This is especially true for the dark siren analysis in GW cosmology,\nwhich takes the host galaxy weighting model as input. The dark siren analysis is based on the assumption of BBHs are\nhosted in galaxies, so it combines the luminosity distance information of a BBH GW event with redshift information\nfrom a galaxy catalogue, to infer the Hubble constant and other cosmological parameters (Schutz 1986; The LIGO\nScientific Collaboration and The Virgo Collaboration et al. 2017). Here, the host galaxy weighting model plays an\nimportant role as it determin", "aboration and The Virgo Collaboration et al. 2017). Here, the host galaxy weighting model plays an\nimportant role as it determines which galaxies are more likely to host the BBHs and mishandling it could significantly\nbias the result (Perna et al. 2024; Hanselman et al. 2025). On the other hand, this also means the test of host galaxy\nweighting models can also be done using GW cosmology analysis tools. At this point, this is not very feasible given\nthe current detector sensitivity and galaxy catalogue, as is mentioned above that the results of different host galaxy\nweighting models did not differ enough in Abbott et al. (2023a). However, it could be possible with future O5 LVK\ndetector network and better galaxy catalogues which may include new sky surveys like DESI and EUCLID (Laureijs\net al. 2012; Abbott et al. 2020; DESI Collaboration et al. 2022; LIGO Scientific Collaboration 2024).\nSo in this paper, we carry out a mock data analysis to perform Bayesian model comparisons for three host galaxy\nweighting mod", ").\nSo in this paper, we carry out a mock data analysis to perform Bayesian model comparisons for three host galaxy\nweighting models with the GW cosmology analysis tool gwcosmo and the mock catalogue MICECATv2 (See Sec.3.1).\nWe first generate mock BBH populations and inject them into a subset of MICECATv2 based on a “true” host galaxy\nweighting model. Then the mock GW events of the BBH populations are generated by the fisher matrix tool GWFish\n(see Sec.3.2). In this case, we use DESI r-band luminosity weighting for injection and compared it to DESI g-band\nluminosity weighting and uniform weighting. Next, we use gwcosmo to calculate the Bayes factors among these three\nhost galaxy weighting models and test if it is possible to distinguish them. To simplify the test, we fixed the cosmology\nand the population parameters in gwcosmo but tried both cases with the rate evolution model fixed or unfixed (see\nEq.1 in Sec.2 for definition of rate evolution model). In the end, our results show that under our setup,∼200 det", "r unfixed (see\nEq.1 in Sec.2 for definition of rate evolution model). In the end, our results show that under our setup,∼200 detections\ncould show minor preference over the true model while for∼1000 detections the preference over the true model can\nbe decisive against uniform weighting. The results are also decided by small number of well-localised events.\nThe structure of our work is organised as follows. In Sec.2 we talk about the theory behind gwcosmo and how to use\nit to perform host galaxy weighting model comparison. In Sec.3, the mock data setup in this paper will be discussed\nand the mock galaxy catalogue MICECATv2 as well as the GWFish pipeline will be introduced in Sec.3.1 and Sec.3.2\nrespectively. In Sec.4 we will show the results of our analysis. The conclusion and a discussion will be given in Sect.5\n2. METHODOLOGY\nAsismentionedinSec.1, wemodifiedtheGWcosmologypipeline, gwcosmo2.0, tocomparethehostgalaxyweighting\nmodels in this paper. gwcosmo is a pipeline developed by Gray et al. (2020, 2022, 202", "wcosmo2.0, tocomparethehostgalaxyweighting\nmodels in this paper. gwcosmo is a pipeline developed by Gray et al. (2020, 2022, 2023) to estimate cosmological and\nGW population parameters using gravitational-wave observations, both bright sirens and dark sirens. In gwcosmo, the\ndark siren method with galaxy catalogues combines the redshift information of the galaxies from the catalogue with\nthe parameter posteriors of GW events to infer cosmological and GW population parameters. The analysis is done by\n3\nBayesian analysis with the mathematical expression of cosmological parameter posteriors as:\np (Λ | {xGW}, {DGW}, I) ∝p(Λ | I)p (Ndet | Λ, I) Selection\n×\nNdetY\ni\n\n\nZZ NpixX\nj\np (xGWi | Ωj, z, θ′, Λ, I) p (θ′ | Λ, I) p (z | Ωj, Λ, I) dθ′dz\n\n (1)\nHere Λ = {Λcosmo, Λpopulation, Λrate} means the hyper-parameters of interest including cosmological parametersΛcosmo,\nGW source population parametersΛpopulation, and the parametersΛrate that describe rate evolution models, defined as\nhow the rate of the GW source evolv", "rametersΛpopulation, and the parametersΛrate that describe rate evolution models, defined as\nhow the rate of the GW source evolves with redshift. In addition,xGW means the gravitational wave data,DGW, Ndet\nmean the detection of a GW event and the number of detections,Ω, z, θmean the sky location, redshift, and other\nparameters of the GW source, andI represents all the other background information. In addition, since gwcosmo\ndivides the sky into pixels to calculate catalogue incompleteness, herej represents individual pixels andNpix means\nthe total number of healpix pixels. Eq. 1 basically states that the posterior on cosmological parameters depends the\nprior of the parameterp(Λ | I), the detection probabilityp(Ndet | Λ, I), the selection bias correctionSelection(the fact\nthat not all events can be seen), the GW likelihoodp (xGWi | Ωj, z, θ′, Λ, I) and the line-of-sight (LOS) redshift prior\np (z | Ωj, Λ, I) mentioned in Sec.1 which will contain the information of host galaxy weighting model as is shown in\nthe ", " prior\np (z | Ωj, Λ, I) mentioned in Sec.1 which will contain the information of host galaxy weighting model as is shown in\nthe following.\nFor the purpose of this paper, the GW likelihood, which can be obtained from the GW parameter estimation (PE)\nposteriors, and line-of-sight (LOS) priors are of the main interest. Gray et al. (2023) shows that LOS prior, i.e. the\nredshift prior brought in by the galaxy catalogue, can be divided into host galaxy in the catalogue term and out\nof catalogue term. But in this paper, we assume the catalogue to be complete, i.e. we can see every galaxy in the\nuniverse. Thus, we only consider the in-catalogue part which has an expression as follows:\np (z | Ωi, Λ, s, I) ∝ p(s | z, Λrate, I)\n\n 1\nNgal (Ωi)\nNgal(Ωi)X\nk\np (z | ˆzk) p (s | z, M(z, ˆmk, Λcosmo) , I)\n\n, (2)\nwhere s, hidden inside I in Eq.1, represents the GW source hosted by the galaxy,M and m are the absolute and\napparent magnitudes of the galaxy. Eq.2 basically sums over the redshift distribution of all galaxies with", " are the absolute and\napparent magnitudes of the galaxy. Eq.2 basically sums over the redshift distribution of all galaxies within one pixel\nalong the line-of-sight, weighs them usingp(s | z, M(z, ˆmk, Λcosmo), I) as their likelihood of hosting GW sources, and\nmultiplies it with the rate evolution modelR(z) = p(s | z, Λrate, I). The termp(s | z, M(z, ˆmk, Λcosmo), I) is exactly the\nmathematical representation of the host galaxy weighting model, the main focus of this paper. During the GWTC-3\nanalysis Abbott et al. (2023a), K band andBJ band luminosities for the GLADE+ galaxies have been used as the\nweights, assuming the distribution in Eq.3. See Dálya et al. (2018, 2022) for details about the GLADE+ catalogue.\np(s | z, M(z, ˆmk, Λ)) ∝ L(M(z, ˆmk, Λcosmo), I), (3)\nwhere L(M(z, ˆmk, Λcosmo), I) here is the luminosity of the galaxy as a function of K-band apparent magnitudeM. In\naddition to K-band andBJ band weighting, there is also the uniform weighting model where each galaxy is viewed to\nhave the same probabi", "n to K-band andBJ band weighting, there is also the uniform weighting model where each galaxy is viewed to\nhave the same probability of hosting BBHs. To compare these different host galaxy weighting models, we calculate\nthe Bayes factors, i.e. compare the evidence of each model. According to Bayesian analysis, the evidence should be\ncalculated by marginalizing the likelihood and prior over the parameter space. In our paper, we fixed the cosmology\nand BBH population parametersΛcosmo and Λpopulation for simplicity so the parameter space will be a delta function.\nAnd for the rate modelp(s | z, Λrate, I) we have used both a simple Powerlaw model with indexγ and Madau-Dickinson\nrate evolution model. The expression for the Powerlaw model is simply:\np(s | z, γ, I) ∝ (1 + z)γ, (4)\nand the expression for Madau-Dickinson rate evolution model according to Madau & Dickinson (2014) is:\nPMadau−Dickinson(s|z, γ, k, zp, I) = [1 + (1 +zp)−γ−k] (1 + z)γ\n1 + [(1 +z)/(1 + zp)]γ+k (5)\nFor the simple Powerlaw model, we test both c", "kinson(s|z, γ, k, zp, I) = [1 + (1 +zp)−γ−k] (1 + z)γ\n1 + [(1 +z)/(1 + zp)]γ+k (5)\nFor the simple Powerlaw model, we test both cases whereγ is fixed at 0, i.e. no rate evolution, or unfixed (see Sec.4\nfor more details). This is because the rate evolution of BBHs is determined by the true host galaxy weighting model\n4\nand can provide information about this true model. However, in this paper we only concern the information from\nindividual events, so we unfix the rate evolution model to remove the extra information from rate evolution. This is\nalso more realistic since in real life we do not have the true host galaxy weighting model. So the final expression of\nevidence is:\nZi ∝\nZ\np (Λ | {xGW}, {DGW}, wi, I) p(Λ|I)dΛ\n∝\nZ\np (γ | {xGW}, {DGW}, wi, Λ′, I) p(γ | I)dγ,\n(6)\nwhere Zi is the evidence for the i-th model,wi represents different weighting models,p(γ | I) is assumed to be uniform,\nandΛ′ = {Λcosmo, Λpopulation}. With the expression of evidence, the Bayes factor between host galaxy weighting models\nis just the", "ndΛ′ = {Λcosmo, Λpopulation}. With the expression of evidence, the Bayes factor between host galaxy weighting models\nis just the ratio between their evidence,B i\nj\n= Zi/Zj.\nWe apply the method above on GWFish processed mock BBH GW events which are injected into mock galaxy\ncatalogue MICECATv2 with cosmology and BBH population model fixed as is shown in flowchart Fig.1. The setup of\nthe mock data as well as host galaxy weighting model choices will be discussed in Sec.3.\nFigure 1.This is the flow chart of this paper, showing how we used gwcosmo to calculate the evidence of different host galaxy\nweighting models. To output the evidence, gwcosmo requires input of GWFish-generated mock GW events, selection effect, and\nthe LOS redshift prior generated by mock galaxy catalogue MICECATv2 and different host galaxy weighting models. And by\ncomparing the evidence we have the Bayes factors\n3. MOCK DATA\n3.1. Mock catalogue: MICECATv2\nTo generate the LOS redshift prior in Eq.2, the mock galaxy catalogue MICECATv2 (MICE-Gra", "CK DATA\n3.1. Mock catalogue: MICECATv2\nTo generate the LOS redshift prior in Eq.2, the mock galaxy catalogue MICECATv2 (MICE-Grand Challenge Galaxy\nand Halo Light-cone Catalog) is used in a complete catalogue case. It is built on the MICE cosmology simulation and\navailable on COSMOHUB1, a distribution centre of a range of mock or real galaxy catalogues(Carretero et al. 2017;\nTallada et al. 2020).\n1 https://cosmohub.pic.es\n5\nThe MICE Grand Challenge simulation is an N-body simulation of about 70 billion dark matter particles in a flat\nΛCDM universe with H0 = 70km/s/Mpc and Ωm = 0.25, which will be the cosmology setup in this paper as well\n(Hoffmann et al. 2015; Fosalba et al. 2015a,b). The dark matter particles in MICE simulations form halos due to gravity\nand MICECATv2 used a halo occupation distribution (HOD) recipe and the subhalo abundance matching (SHAM)\ntechniques to generate galaxies from these dark matter halos. The results were also calibrated to observations. See\nCrocce et al. (2013); Carretero et al", "laxies from these dark matter halos. The results were also calibrated to observations. See\nCrocce et al. (2013); Carretero et al. (2015) for details about the generation of the catalogue.\nMICECATv2 offers the absolute and apparent magnitudes of 500 million galaxies in the observation bands of the\nDESI (Dark Energy Spectroscopic Instrument) telescope, calibrated by r-band luminosity Schechter function based\non real local universe observations (DESI Collaboration et al. 2022). Covering one octant of the sky, it claims to be\ncomplete for DES-like surveys out to redshiftz = 1.4 (for i-band apparent magnitude smaller than 24) with low mass\ngalaxies from dark matter halos with as low as 10 dark matter particles.\nGiventhevastnumberofgalaxiesinMICECATv2, itisnecessarytodrawsamplesofgalaxiestoreducecomputational\ncost. In this paper we first slice MICECATv2 at r-band absolute magnitude -20, ignoring all the galaxies fainter than\nthis threshold. We apply this magnitude cut also because we would like to make our mock gal", "noring all the galaxies fainter than\nthis threshold. We apply this magnitude cut also because we would like to make our mock galaxy catalogue volume\nlimited, i.e. being a complete catalogue given this r-band absolute magnitude threshold for the whole redshift range.\nBy applying this cut we assume only the brightest galaxies are able to host BBHs for this initial research, similar\nto Naveed et al. (2025). For the comparison results of a higher cut on r-band absolute magnitude (i.e., including\nmore faint galaxies), please check Appendix A. We then randomly draw 10% from galaxies that passed the -20 r-band\nthreshold and assume this sliced catalogue to be complete toz = 1.4 with around 9 million galaxies used in total and\nhundreds of galaxies in one pixel on the nside=128 healpix skymap used in this paper. It should be noted that this\nartificial low density of galaxies will make our results more optimistic since fewer galaxies means easier to locate the\nhost galaxy. The distribution of galaxies used in this paper", "lts more optimistic since fewer galaxies means easier to locate the\nhost galaxy. The distribution of galaxies used in this paper over r-band and g-band luminosity is shown in Fig.2.\nFor the redshift uncertainty of the galaxies in our mock catalogue, we assume spectroscopic redshift. For each galaxy,\nthe redshift has a Gaussian distribution centring at their true redshift with the standard deviation being:\nσi = 0.001 × (1 + zi), (7)\nwhere zi and σi are the redshift and redshift uncertainty of the i-th galaxy.\nSince MICECATv2 is calibrated to the DESI r-band, the host galaxy weighting models we decided to test in the\nend are the luminosity weighting models of DESI observation bands including r-band luminosity weighting, g-band\nluminosity, and uniform weighting. We injected mock GW events into MICECATv2 galaxies using r-band weighting\nand calculated the LOS redshift priors of these three models for the sliced catalogue respectively. The LOS redshift\nprior comparison between r-band weighting, g-band weighting and", "e models for the sliced catalogue respectively. The LOS redshift\nprior comparison between r-band weighting, g-band weighting and uniform weighting of a random example pixel on a\nnside=128 healpix skymap is shown in Fig.3, and it is clear that the redshift prior from the three models is different\nand this is where the constraining power of this approach comes from. It should also be noted that r-band weighting\ndiffers from uniform weighting more than g-band weighting, so we would expect that the method distinguish r-band\nweighting and uniform weighting better than r-band and g-band weighting. This also means our results for r-band\nversus g-band would likely to be more pessimistic compared to other optical bands since they are quite close to each\nother.\n3.2. Mock BBH GW events\nSince we use dark siren analysis method to test different host galaxy weighting models, it is necessary to generate the\nGW likelihoodp (xGWi | Ωj, z, θ′, Λ, I) in Eq.1. This requires simulating detection results and PE posteriors of mock\n", "erate the\nGW likelihoodp (xGWi | Ωj, z, θ′, Λ, I) in Eq.1. This requires simulating detection results and PE posteriors of mock\nBBH populations. In this paper, we simulate the PE posterior outputs for detected BBH events with fisher matrix\nanalysis. We assume an O5 sensitivity three detector network : LIGO-Hanford, LIGO-Livingston, and Virgo for this\ninitial paper(Acernese et al. 2014; Collaboration et al. 2015; Abbott et al. 2020; Effler et al. 2023; LIGO Scientific\nCollaboration 2024). The mock BBH populations and PE results are generated in the following manner:\nWe first generate the source parameters of the BBH population. The masses of the BBHs are generated in the\nsource frame using the BBH Powerlaw+Peak mass model the same with GWTC-3 setup Abbott et al. (2023a). Other\nparameters within consideration here follow a uniform distribution within their prior range, namely{θJN , Ψ, ϕ, tc}.\nThe parameters for the Powerlaw+Peak model and the prior ranges for{θJN , Ψ, ϕ, tc} are shown in Tab.3.2. In terms\nof th", "ϕ, tc}.\nThe parameters for the Powerlaw+Peak model and the prior ranges for{θJN , Ψ, ϕ, tc} are shown in Tab.3.2. In terms\nof the rate evolution modelp(s|z, γ, I), we chooseγ = 0 in the Powerlaw mode in Eq.4.\nOnce generated, we injected these mock BBH events into MICECATv2 galaxies based on the r-band luminosity\nweighting of each galaxy. The BBH mergers follow the redshift and sky location of their host galaxies.\n6\nFigure 2. This is the distribution of galaxies over r-band and g-band absolute magnitude used in this paper. These galaxies\nare randomly sampled 10% from the subset of MICECATv2 with r-band absolute magnitude cut at -20.\nFigure 3. This is the comparison of the LOS redshift prior between different weighting models of an example pixel. The left\npanel (a) compares r-band weighting and uniform weighting while the right panel (b) compares r-band weighting and g-band\nweighting. The resolution of the pixel is 128. Note that the uniform weighting has a varyingp(z) because: first the width of\nthe Gaussian d", "The resolution of the pixel is 128. Note that the uniform weighting has a varyingp(z) because: first the width of\nthe Gaussian distribution is increasing with redshift according to Eq.7, second the galaxies tend to cluster together based on\nthe dark matter halo.\n7\nThe optimal signal-to-noise ratio (SNR) of these mock events will be calculated, and we apply the SNR threshold 18\nto the optimal SNRs. The events with SNR passed this threshold will be considered as detected proceed for mock PE.\nThis SNR threshold 18 is higher than normally used 11 because GWFish performs better at higher SNR, and higher\nSNR means better luminosity distance uncertainty and localisation.\nThe likelihood of the detected events will then be calculated using Fisher matrices with the tool GWFish (Dupletsa\net al. 2023). Fisher matrices simulated PE results are cheap to generate and thus suitable for this paper which is\nexpected to require a large number of GW events to tell the differences among host galaxy weighting models.\nThe Fisher ma", "ich is\nexpected to require a large number of GW events to tell the differences among host galaxy weighting models.\nThe Fisher matrix method is based on the Gaussian approximation of the likelihood function which is valid for high\nSNR signals:\nL ∝exp\n\u0012\n−1\n2∆θiFij∆θj\n\u0013\n, (8)\nwhere ∆θ = θ − ¯θ is the error from the true value of the parameter vector¯θ. Here Fij are the Fisher matrices which\nare calculated from the derivative of a waveform with respect to the parametersθ given some detector noise spectral\ndensity. It is also the inverse of the covariance matrix. We refer to Dupletsa et al. (2023) again for detailed expression\nof the fisher matrices. The waveform model we used for derivative calculation is IMRPhenomXPHM (Pratten et al.\n2021). From the input parameters of IMRPhenomXPHM, we consider the following parameters to be included inθ,\ni.e., the parameters that are used to calculate the derivative:\nθ = {m1,d, m2,d, dL, θJN , δ, α,Ψ, ϕ, tc}, (9)\nwhere m1,d, m2,d are the detector-frame primary and secondary ma", " the derivative:\nθ = {m1,d, m2,d, dL, θJN , δ, α,Ψ, ϕ, tc}, (9)\nwhere m1,d, m2,d are the detector-frame primary and secondary masses,dL is the luminosity distance,δ is the decli-\nnation, α is the right ascension, and other parameters have already been mentioned above.\nWe then calculate the posteriorp(Ω, z, θ| xGWi, Λ, I) and draw posterior samples from it. We first apply a prior\np(Ω, z, θ| Λ, I) on the likelihoodp (xGWi | Ωj, z, θ′, Λ, I) to calculatep(Ω, z, θ| xGWi, Λ, I). The mass and luminosity\npriors are the same with the GWTC-3H0 inference paper Abbott et al. (2023a) since gwcosmo 2.0 will automatically\nremove these priors from posterior samples to compute likelihood. These priors are a uniform distribution for the\ndetector frame mass and ad2\nL prior for the luminosity distance:p(dL(z, Λ)) ∝ d2\nL. The rest of the parameters are not\nof concern here. The posterior samples will then be drawn fromp(Ω, z, θ| xGWi, Λ, I) using rejection sampling, during\nwhich samples of withm1 < m2 will be thrown away to get t", "n be drawn fromp(Ω, z, θ| xGWi, Λ, I) using rejection sampling, during\nwhich samples of withm1 < m2 will be thrown away to get the correct primary mass and secondary mass distribution.\nTo illustrate the uncertainty of of the posterior under the detector network setup we used in this paper, we show\nthe distribution ofσdL/dL for luminosity distance and 99% of the sky localisation area in Fig.4.\nFinally, to correctly perform the inference using gwcosmo, it is necessary to calculate the selection effects in Eq.1.\nThe selection effect determines which part of source parameter space is detectable and the according bias from this.\nFor gwcosmo, the input for selection effect calculation is a list of detectable (i.e. able to pass the SNR threshold)\nGW events generated in the detector frame to calculate selection effects. A detailed derivation of selection effect can\nbe found in Gray et al. (2023). To generate this list of detectable events in our paper, we first calculate the optimal\nSNR of a BBH population which has ", "023). To generate this list of detectable events in our paper, we first calculate the optimal\nSNR of a BBH population which has a wide detector frame mass prior, uniform from 1 to 500 solar masses. The wide\ndetector frame mass prior is applied because it covers large parameter space for source frame mass and redshift. We\nthen apply the SNR threshold of 18 to the SNR of these event and record the events that can pass the threshold.\nThese BBHs follow a redshift prior uniform in comoving volume.\n4. ANALYSIS AND RESULTS\nWe first conducted our tests with three populations (Population 1,2,3) and fixed cosmological parameters. Each\npopulation has 5000 BBH injections drawn from priors described in Sec.3.2. From these injections, around 200 of them\nare detected. All different populations are drawn from the same mass model as mentioned in Tab.3.2 and injected\ninto MICECATv2 galaxies based on r-band weighting. We test multiple populations to quantify the variation that can\narise from the random sample. For each populati", "-band weighting. We test multiple populations to quantify the variation that can\narise from the random sample. For each population, we run our tests in two cases: one is fixing the rate evolution\nparameter γ in Eq.4 to be 0 and the other one is unfixingγ. This is to show the influence of the BBH rate evolution\nof each host galaxy weighting model in our analysis as we have explained in Sec.2. We present the full-sky redshift\npriors for different host galaxy weighting models and the Bayes factors of individual events to further explain this fact.\nAccording to Abbott et al. (2023b), the estimated BBH merger rate is between 17.9 and 44Gpc−3yr−1 increasing with\nredshift at a rate proportional to(1 + z)κ with κ = 2.9. Based on this BBH rate and our detection efficiency, i.e. we\n8\nParameters Description Value\nMmin Minimum value for black hole source frame mass prior 4.98\nMmax Maximum value for black hole source frame mass prior 112.5\nα Powerlaw index for the primary mass 3.78\nµg Centre of the Gaussian component in t", "for black hole source frame mass prior 112.5\nα Powerlaw index for the primary mass 3.78\nµg Centre of the Gaussian component in the primary mass distribution 32.27\nσg Standard error of the Gaussian component in the primary mass distribution 3.88\nλpeak Fraction of the model in the Gaussian component 0.03\nδm Range of mass tapering on the lower end of the mass distribution 4.8\nβ Powerlaw index for the secondary mass 0.81\nθJN Angle between the total angular momentum vector and the line of sight to the observerU(−π, π)\nΨ Polarization angle U(0, 2π)\nϕ Phase U(0, 2π)\ntc Geocentric time U(0, tmax)\nH0 Hubble constant 70.0\nΩm Matter energy density 0.25\nTable 1. Here are the parameters for the Powerlaw+Peak mass model, the uniform distributions ofθJN , Ψ, ϕ, tc, and the\ncosmology parameters used to generate the BBH population.\nFigure 4. Here are two plots showing the 1σ uncertainty distribution estimated by GWFish. The left panel (a) shows the\ndistribution of uncertainties of luminosity distance in ratio while the right ", "estimated by GWFish. The left panel (a) shows the\ndistribution of uncertainties of luminosity distance in ratio while the right panel (b) shows the distribution of 99% sky localisation\narea against redshift. This example population consists of 214 mock BBH detection.\ncan detect around 200 BBHs out of 5000 BBH injections, the∼200 detection case would be an estimation of the O5\nLVK run lasting for a few months.\nWe also test two more cases with∼1000 detection populations (Population 4,5) andγ unfixed to show the effect of\nadding more GW events. This number of detections represents a hypothetical scenario of O5 lasting for over a year\ngiven the estimated BBH detection rate mentioned above. The BBHs in the two∼1000 detection populations are\ngenerated and injected into MICECATv2 galaxies in the exact same way with other populations (Population 1,2,3).\nFinally, we substitute the simple Powerlaw rate model described in Eq.4 with the more sophisticated Madau-\nDickinson rate evolution model described in Eq.5 to test if", "rlaw rate model described in Eq.4 with the more sophisticated Madau-\nDickinson rate evolution model described in Eq.5 to test if Madau-Dickinson model compensates the rate evolution\ninformation better. We apply the Madau-Dickinson model to the analysis of the three∼200-detection populations\n(Population 1,2,3) and compare the Bayes factors results to the results of the simple Powerlaw model.\n4.1. Rate evolution model parameterγ fixed case\nTab.2 illustrates the Bayes factors between the different host galaxy weighting models with r-band weighting being\nthe truth. However, the results of the three populations are not entirely consistent. For example, for Population 1\n9\nBayes factors r-band / g-band r-band / uniform weighting g-band / uniform weighting\nPopulation 1 (214 detections) 3.79 4.30 1.14\nPopulation 2 (224 detections) 10.4 4.82 0.46\nPopulation 3 (200 detections) 2.95 0.42 0.14\nTable 2.This is the Bayes factor results of Population 1, 2, 3 among r-band weighting, g-band weighting, and uniform weighting\nmod", "ble 2.This is the Bayes factor results of Population 1, 2, 3 among r-band weighting, g-band weighting, and uniform weighting\nmodels. They are 3 5000-BBH populations with 214, 224, and 200 detections respectively. The simple Powerlaw rate evolution\nmodel parameterγ was fixed to be 0, i.e. no rate evolution.\nand Population 2, r-band is favoured against uniform weighting at a Bayes factorB = 4.30, 4.82 but for Population\n3 r-band is slightly disfavoured (B = 0.42). Although r-band weighting is closer to g-band weighting than uniform\nweighting, the Bayes factors for r-band over g-band are still smaller than the Bayes factors for r-band over g-band for\nPopulation 2 and 3. To explain the reason for this issue, we plot the distribution of Bayes factors of r-band weighting\nversus uniform weighting,B r−band\nuniform\n, for individual detections in Population 1 against redshift in Fig.5. According to\nFig.5, the Bayes factors for individual detections are correlated with their redshift, and thus the overall Bayes factors\n", "ng to\nFig.5, the Bayes factors for individual detections are correlated with their redshift, and thus the overall Bayes factors\nshould fluctuate with the redshift distribution of detected events. This redshift evolution of Bayes factors is the result\nof the BBH rate evolution introduced by host galaxy weighting models. Different host galaxy weighting models will\nassume different BBH rate evolution, so the redshift of individual events will have an effect on their Bayes factors.\nFigure 5. These are r-band weighting versus uniform weighting Bayes factor results,B r−band\nuniform\n, plotted against redshift for\nindividual events in Population 1, withγ fixed to be 0. It is clear that there is correlation between the redshift of the event and\nthe Bayes factor.\n10\nFigure 6.This figure illustrates the overall full-sky redshift priors of MICECATv2 for r-band weighting, g-band weighting, and\nuniform weighting. It shows that different host galaxy weighting models have different rate evolution assumptions, e.g. uniform\nwe", "iform weighting. It shows that different host galaxy weighting models have different rate evolution assumptions, e.g. uniform\nweighting prefers low redshift events than r-band weighting.\nThe rate evolution assumption of each host galaxy weighting model is shown in Fig.6 as the full-sky redshift prior.\nAccording to Fig.6, if the uniform weighting is the truth, there will be more events at low redshift relative to high\nredshift ones compared to r-band weighting, thus more low redshift events will produce a Bayes factor that favours\nthe uniform weighting model to the r-band luminosity weighting model. However, since the true model we used for\ninjecting BBHs is the r-band weighting, the BBH populations follow the rate evolution of full-sky r-band weighted\nredshift prior. This is why when LOS redshift priors of other weighting models are used, it is necessary to apply a\nseparate rate evolution model to compensate for the difference between the full-sky redshift prior of the model in use\nand that of the true model.", "ution model to compensate for the difference between the full-sky redshift prior of the model in use\nand that of the true model. This is also mentioned in Gray et al. (2023) which explains that the rate evolution model\nin the script is meant to represent any extra redshift evolution in addition to the full-sky LOS redshift priors.\nIt should also be noted that although in Fig.5 the redshift strongly correlates with Bayes factors, this correlation\nis weaker at low redshift. The low redshift events have more random Bayes factors compared to high redshift events,\nthis is because low-redshift events are likely to be better localised so the information from localisation of individual\nevents actually becomes more important. This will be discussed in detail with Fig.9 later.\n4.2. Rate evolution model parameterγ unfixed case\nWe also carry out tests with the rate evolution model in Eq.6 unfixed and then marginalised over. This will\ncompensate for these differences in redshift evolution among different host galaxy weigh", "d and then marginalised over. This will\ncompensate for these differences in redshift evolution among different host galaxy weighting models. In this test,\nwe apply a simple PowerLaw model, Eq.4, to the same populations in Tab.2 with parameterγ, the Powerlaw index,\nbeing unfixed. The posteriors ofγ for the Population 1 in Tab.2 are shown in Fig.7 and it is clear that the Powerlaw\nrate evolution model compensated the three host galaxy weighting models differently. Furthermore, we reconstruct the\n11\nBayes factors r-band / g-band r-band / uniform weighting g-band / uniform weighting\nPopulation 1 (214 detections) 1.56 2.40 1.54\nPopulation 2 (224 detections) 1.99 17.6 8.87\nPopulation 3 (200 detections) 0.60 1.77 2.93\nTable 3. This is the Bayes factor results of the same Population 1, 2, 3 in Tab.2 among r-band weighting, g-band weighting,\nand uniform weighting models. The simple Powerlaw rate evolution model parameterγ was unfixed and then marginalised to\ncalculate the Bayes factors.\ncompensated full-sky redshift p", "ate evolution model parameterγ was unfixed and then marginalised to\ncalculate the Bayes factors.\ncompensated full-sky redshift prior for the three host galaxy weighting models by multiply the estimated rate evolution\nmodel with full-sky redshift priors:p(z)p(s|z). We then compare it with the original full-sky redshift prior in Fig.8.\nFrom Fig.8 we can see that the compensation, i.e. marginalizing over the BBH rate evolution model parameterγ, did\ntry to “push” the full-sky redshift priors of the three models closer to each other. Although it is still not perfectly\naligned, there is no doubt that the rate evolution has less effect on the Bayes factors.\nFigure 7.This is the posterior ofγ for Population 1 for the three host galaxy weighting models. It is clear that all three results\ndo not peak at 0 and do not peak at the same place, implying that they are compensated differently and contain different rate\nevolution assumptions.\nThe Bayes factor results for the whole three populations are shown in Tab.3. Here Tab", "tain different rate\nevolution assumptions.\nThe Bayes factor results for the whole three populations are shown in Tab.3. Here Tab.3 show a result that is more\nconsistent with Fig.6 than Tab.2. The Bayes factors distinguish r-band weighting and uniform weighting better than\nr-band and g-band with bigger|log(B)|, which is as expected from Fig.6 since r-band weighting is more different from\nuniform weighting than g-band weighting.\nTo show the effect of having more GW events, we conduct another test with two∼1000 detection populations\n(Population 4 and 5). The result is shown in Tab.4. The first two rows show the Bayes factor results of Population\n12\nFigure 8.This figure compares the original overall full-sky redshift priors in Fig.6 (dashed lines) and the compensated full-sky\nredshift priors for all three host galaxy weighting models (solid lines). It shows how the compensation pushes the three full-sky\nredshift priors towards each other, thus compensating the information from the BBH rate evolution contributing ", "e three full-sky\nredshift priors towards each other, thus compensating the information from the BBH rate evolution contributing to the Bayes\nfactors, making the Bayes factors depend more on localisations of individual events.\nBayes factors r-band / g-band r-band / uniform weighting\nPopulation 4 (1151 detections) 8.61 9.75 × 104\nPopulation 5 (1062 detections) 1.76 1.55 × 103\nPopulation 4 without top 10Br−band\ng−band\nevents 2.04\nPopulation 4 without top 10B r−band\nuniform\nevents 7.22 × 103\nTable 4.The first two rows are the Bayes factor results of Population 4 and 5 among r-band weighting, g-band weighting, and\nuniform weighting models. They are 2 25000-BBH populations with 1151 and 1062 detections respectively. The last two rows\nare the Bayes factor results for Population 4 excluding the 10 most informative events in each case. To be more specific, we\ncalculated the Bayes factor resultsBi\nj\nof each individual events, and excluded the events with 10 highest Bayes factors in the\naccording case. The BBH rate evol", "tsBi\nj\nof each individual events, and excluded the events with 10 highest Bayes factors in the\naccording case. The BBH rate evolution parameterγ was unfixed and later marginalised.\n4 and 5 while the the last two rows show the Bayes factors of Population 4 without the 10 most informative events\nin each case (the informativeness of each individual event is evaluated by its own Bayes factor results). From the\nfirst two rows of Tab.4, it is clear that the Bayes factors between r-band weighting and uniform weighting increase\nsignificantly with more BBH events compared to Tab.3. There is also improvement on r-band versus g-band especially\nin Population 4. This means the method distinguishes these host galaxy weighting models better with more BBH\ndetections, especially for host galaxy weighting models that are more different, e.g. r-band and uniform weighting\nhere.\n13\nAnother point in Tab.4 is although Population 4 and 5 have similar numbers of events, the Bayes factors of Population\n4 is bigger than those of Popula", " is although Population 4 and 5 have similar numbers of events, the Bayes factors of Population\n4 is bigger than those of Population 5 for around a magnitude. However, by excluding ten 10 most informative events\nfor both cases (third and fourth row), The Bayes factors drop to the same magnitude of Population 5 (second row).\nThis means the full Population 4 results (first row) are dominated by a small number of highly informative events. This\nimplies that very well-localised CBC mergers, also known as gold dark sirens, can be very important in distinguishing\nhost galaxy weighting models.\nFigure 9.This figure show the Bayes factors among the three host galaxy weighting models marginalised over theγ posteriors\nof individual events in Population 4 and 5. The left panel (a) is for Bayes factors of r-band versus g-band while the right panel\n(b) is Bayes factors for r-band versus uniform weighting. The x-axis represents the localisation volume of the BBH events within\n99% of the sky localisation area anddL ± 3σdL.\nT", "ighting. The x-axis represents the localisation volume of the BBH events within\n99% of the sky localisation area anddL ± 3σdL.\nTo further illustrate this point, we show the distribution of Bayes factors plotted against the localisation volume\nfor each event. The volume covers 99% of the sky localisation area anddL ± 3σdL. The figure is shown in Fig.9.\nFirst of all we can see a clear correlation between the localisation volume,Vlocalisation, and Bayes factors, although\ndifferent correlations for different Bayes factors. This is still because of the rate evolution model (asVlocalisation has\na strong correlation withz) but this does not mean our overall results are dominated by rate evolution information\nand marginalisation overγ does not work. In fact, the marginalisation overγ method only works on population level,\nnot on individual event level since one event contributes little to theγ posterior. The high redshift events and low\nredshift events will balance the rate evolution information of each other. Second", "eγ posterior. The high redshift events and low\nredshift events will balance the rate evolution information of each other. Second, at lowVlocalisation, i.e. when events\nare really well-localised, the individual event Bayes factors deviate from the trend, meaning that it is driven by specific\ngalaxy information within the localisation, rather than the overall redshift distribution. At lowVlocalisation, while\nr-band versus g-band Bayes factors in the left panel seem rather random, the r-band versus uniform weighting Bayes\nfactors in the right panel clearly go against the trend and favour r-band. This is expected since uniform weighting is\nmuch more different to r-band than g-band. The figure also shows the significant contribution from a small number of\nwell-localised events, for example the most-informative event in the right panel has a Bayes factor over 3.\n4.3. Madau-Dickinson rate evolution model unfixed case\nWe also conduct a test to use Madau-Dickinson rate evolution model to find out if a more complicated", "volution model unfixed case\nWe also conduct a test to use Madau-Dickinson rate evolution model to find out if a more complicated and flexible\nrate evolution model compensates the rate evolution better than the simple Powerlaw model. The mathematical\nexpression of Madau-Dickinson model is given in Eq.5. we have unfixed γ, k, and zp and marginalised over the\nparameter space using a Bayesian inference tool BILBY and a nested sampling tool NESSAI in our test (Ashton et al.\n2019; Williams et al. 2021).\n14\nBayes factors for Population 1 (214 detections)r-band / g-band r-band / uniform weighting\nMadau-Dickinson model 1.66 2.26\nSimple Powerlaw model 1.56 2.40\nTable 5. This is the comparison of Bayes factors for Population 1 using Madau-Dickinson rate evolution model and simple\nPowerlaw model. The simple Powerlaw result is taken from Tab.3. The Madau-Dickinson rate evolution parametersγ, k, and\nzp were unfixed and later marginalised.\nGiven the computational cost, we only test Madau-Dickinson model with Population 1 me", "nd\nzp were unfixed and later marginalised.\nGiven the computational cost, we only test Madau-Dickinson model with Population 1 mentioned in Tab.2 and\nTab.3. The result is shown in Tab.5, which compares the result using Madau-Dickinson model with that using the\nsimple Powerlaw model. However, the difference is trivial, possibly implying a more sophisticated rate evolution model\nis needed here or the inherent structural differences among the full-sky redshift priors cannot be perfectly compensated\nusing Powerlaw-like models in MICECATv2.\n5. CONCLUSION\nIn this paper, we test the possibility of distinguishing BBH host galaxy weighting models using gwcosmo with a\nmock galaxy catalogue drawn from MICECATv2 and mock BBH PE results from GWFish. Our method calculates the\nBayes factors between different host galaxy weighting models by comparing their evidence in the standard gwcosmo\ndark siren cosmology analysis. We assume fixed cosmology and BBH population during the analysis. The analysis is\nconducted with r-band (“tr", "cosmology analysis. We assume fixed cosmology and BBH population during the analysis. The analysis is\nconducted with r-band (“true” model in our test) and g-band luminosity weighting models as well as uniform weighting\nunder an O5 sensitivity three detector network including LIGO-Hanford, LIGO-Livingston, and Virgo. The three\nmock populations have around 200 detections each. We should note that by reducing the number of galaxies for\ncomputational reasons, our results will be more optimistic. However the choice of two close bands (DESI r-band and\ng-band) balance our r-band versus g-band Bayes factor results with pessimism. In addition to this choice of close\nbands, the fact that we do not consider KAGRA in this paper also makes our results more pessimistic (Akutsu et al.\n2020). In future papers we would like to consider KAGRA as well but that requires the resolution of LOS redshift\npriors to be even higher.\nWe calculate Bayes factors for both cases where the rate evolution model is fixed and unfixed. For the r", "iors to be even higher.\nWe calculate Bayes factors for both cases where the rate evolution model is fixed and unfixed. For the rate evolution\nfixed case, we find that Bayes factor results are not consistent. This is because the rate evolution of BBHs will add\ninformation in addition to the information from the localisation of individual events. For the rate evolution model\nunfixed case, the simple Powerlaw rate evolution model parameterγ is unfixed and then marginalised to compensate\nthe information from rate evolution. This means the Bayes factors depend more on the localisation of individual GW\nevents. The results align with our expectation: an overall slight preference of r-band over g-band weighting and a\nstrong preference of r-band over uniform weighting, as predicted from the differences among the full-sky redshift priors\nof these models.\nWe also test the case with the number of BBH events increased to around 1000 detections per population. As\nexpected, increasing event numbers do make the Bayes factors", "f BBH events increased to around 1000 detections per population. As\nexpected, increasing event numbers do make the Bayes factors more substantial with rate evolution model unfixed,\nespecially for host galaxy weighting models that are less similar. For both∼1000-detection cases, there is decisive\nsupport for r-band over uniform weighting. It should also be noted that a small number of well-localised events can\ndominate the result, highlighting the importance of golden dark sirens.\nBesides the simple Powerlaw rate evolution model, the more sophisticated Madau-Dickinson rate evolution model is\nalso tested to improve the compensation. However, the change in Bayes factors is small.\nWe show that for future O5/A# sensitivity network and improved galaxy catalogue, it is possible to distinguish\ndifferent weighting models with strong evidence (Bayes factors over 10) under the assumption of fixed cosmology, fixed\nBBH population, and unfixed rate evolution model. This paper also highlights that in the current dark siren ", "ed cosmology, fixed\nBBH population, and unfixed rate evolution model. This paper also highlights that in the current dark siren cosmology\nanalysis, the host galaxy weighting and the rate evolution estimation are correlated, and the rate evolution estimation\nis only part of the actual rate evolution on top of what is already accounted by the full-sky redshift priors of host\ngalaxy weighting models, as was already explained in Gray et al. (2023).\nForfutureinvestigations, itwouldbeusefultoaddmorerealityaboutthegalaxycataloguessuchasaccountingforthe\nincompleteness and more realistic redshift uncertainties, the impact of faint galaxies will also need to be investigated,\nand using a more complicated rate evolution model other than Madau-Dickinson could improve the results as well,\netc. More realistic tests on different host galaxy weighting models will help us to distinguish them in the future with\n15\nO5/A# or even third-generation detectors, and will also be important for BBH formation channel as well as BBH rate\n", "ture with\n15\nO5/A# or even third-generation detectors, and will also be important for BBH formation channel as well as BBH rate\nevolution studies.\n6. ACKNOWLEDGEMENTS\nThis paper is funded by the Chinese Scholarship Council. This paper has used computing resources of LIGO-Virgo\nCollaboration. This work has made use of CosmoHub, developed by PIC (maintained by IFAE and CIEMAT) in\ncollaboration with ICE-CSIC. It received funding from the Spanish government (grant EQC2021-007479-P funded\nby MCIN/AEI/10.13039/501100011033), the EU NextGeneration/PRTR (PRTR-C17.I1), and the Generalitat de\nCatalunya.\nREFERENCES\nAbbott, B., Abbott, R., Abbott, T., et al. 2020, Living\nReviews in Relativity, 23, 1,\ndoi: 10.1007/s41114-020-00026-9\nAbbott, R., Abe, H., Acernese, F., et al. 2023a, The\nAstrophysical Journal, 949, 76,\ndoi: 10.3847/1538-4357/ac74bb\nAbbott, R., Abbott, T. D., Acernese, F., et al. 2023b, Phys.\nRev. X, 13, 011048, doi: 10.1103/PhysRevX.13.011048\nAcernese, F., Agathos, M., Agatsuma, K., et al. 2014,\nClassical an", "3b, Phys.\nRev. X, 13, 011048, doi: 10.1103/PhysRevX.13.011048\nAcernese, F., Agathos, M., Agatsuma, K., et al. 2014,\nClassical and Quantum Gravity, 32, 024001,\ndoi: 10.1088/0264-9381/32/2/024001\nAdhikari, S., Fishbach, M., Holz, D. E., Wechsler, R. H., &\nFang, Z. 2020, The Astrophysical Journal, 905, 21,\ndoi: 10.3847/1538-4357/abbfb7\nAkutsu, T., Ando, M., Arai, K., et al. 2020, Progress of\nTheoretical and Experimental Physics, 2021, 05A101,\ndoi: 10.1093/ptep/ptaa125\nAndrews, J. J., & Mandel, I. 2019, The Astrophysical\nJournal Letters, 880, L8, doi: 10.3847/2041-8213/ab2ed1\nAshton, G., Hübner, M., Lasky, P. D., et al. 2019, The\nAstrophysical Journal Supplement Series, 241, 27,\ndoi: 10.3847/1538-4365/ab06fc\nBroekgaarden, F. S., Berger, E., Stevenson, S., et al. 2022,\nMonthly Notices of the Royal Astronomical Society, 516,\n5737, doi: 10.1093/mnras/stac1677\nCalzetti, D. 2013, Secular Evolution of Galaxies, 419\nCarretero, J., Castander, F. J., Gaztañaga, E., Crocce, M.,\n& Fosalba, P. 2015, Monthly Notices of the Ro", "ution of Galaxies, 419\nCarretero, J., Castander, F. J., Gaztañaga, E., Crocce, M.,\n& Fosalba, P. 2015, Monthly Notices of the Royal\nAstronomical Society, 447, 646,\ndoi: 10.1093/mnras/stu2402\nCarretero, J., Tallada, P., Casals, J., et al. 2017, in\nProceedings of the European Physical Society Conference\non High Energy Physics. 5-12 July, 488\nChruślińska, M. 2024, Annalen der Physik, 536, 2200170,\ndoi: 10.1002/andp.202200170\nClaire, S. Y., Fong, W.-f., Kremer, K., et al. 2019, The\nAstrophysical Journal Letters, 888, L10\nCollaboration, T. L. S., Aasi, J., Abbott, B. P., et al. 2015,\nClassical and Quantum Gravity, 32, 074001,\ndoi: 10.1088/0264-9381/32/7/074001\nCrocce, M., Castander, F. J., Gaztanaga, E., Fosalba, P., &\nCarretero, J. 2013, doi: 10.1093/mnras/stv1708\nDehghani, A., Kim, J. L., Hosseini, D. S., et al. 2025,\nJournal of Cosmology and Astroparticle Physics, 2025,\n056, doi: 10.1088/1475-7516/2025/04/056\nDESI Collaboration, et al. 2022, The Astronomical Journal,\n164, 207, doi: 10.3847/1538-3881/ac882b\nDupl", "88/1475-7516/2025/04/056\nDESI Collaboration, et al. 2022, The Astronomical Journal,\n164, 207, doi: 10.3847/1538-3881/ac882b\nDupletsa, U., Harms, J., Banerjee, B., et al. 2023,\nAstronomy and Computing, 42, 100671,\ndoi: 10.1016/j.ascom.2022.100671\nDálya, G., Galgóczi, G., Dobos, L., et al. 2018, Monthly\nNotices of the Royal Astronomical Society, 479, 2374,\ndoi: 10.1093/mnras/sty1703\nDálya, G., Díaz, R., Bouchet, F. R., et al. 2022, Monthly\nNotices of the Royal Astronomical Society, 514, 1403,\ndoi: 10.1093/mnras/stac1443\nEffler, A., Fritschel, P., Hall, E., & Landry, M. 2023.\nhttps://dcc.ligo.org/LIGO-M2300107/public\nFosalba, P., Crocce, M., Gaztañaga, E., & Castander, F. J.\n2015a, Monthly Notices of the Royal Astronomical\nSociety, 448, 2987, doi: 10.1093/mnras/stv138\nFosalba, P., Gaztañaga, E., Castander, F. J., & Crocce, M.\n2015b, Monthly Notices of the Royal Astronomical\nSociety, 447, 1319, doi: 10.1093/mnras/stu2464\nGray, R., Messenger, C., & Veitch, J. 2022, Monthly\nNotices of the Royal Astronomical Society", ", 1319, doi: 10.1093/mnras/stu2464\nGray, R., Messenger, C., & Veitch, J. 2022, Monthly\nNotices of the Royal Astronomical Society, 512, 1127,\ndoi: 10.1093/mnras/stac366\nGray, R., Hernandez, I. M. n., Qi, H., et al. 2020, Phys.\nRev. D, 101, 122001, doi: 10.1103/PhysRevD.101.122001\nGray, R., Beirnaert, F., Karathanasis, C., et al. 2023,\nJournal of Cosmology and Astroparticle Physics, 2023,\n023, doi: 10.1088/1475-7516/2023/12/023\n16\nHanselman, A. G., Vijaykumar, A., Fishbach, M., & Holz,\nD. E. 2025, Gravitational-wave Dark Siren Cosmology\nSystematics from Galaxy Weighting, The American\nAstronomical Society, doi: 10.3847/1538-4357/ad9393\nHoffmann, K., Bel, J., Gaztañaga, E., et al. 2015, Monthly\nNotices of the Royal Astronomical Society, 447, 1724,\ndoi: 10.1093/mnras/stu2492\nHosseini, D. S., Dehghani, A., Kim, J. L., et al. 2025,\nModeling Gravitational Wave Bias from 3D Power\nSpectra of Spectroscopic Surveys.\nhttps://arxiv.org/abs/2506.11201\nKorytov, D., Hearin, A., Kovacs, E., et al. 2019,\ndoi: 10.3847/1538-4365/", "pectroscopic Surveys.\nhttps://arxiv.org/abs/2506.11201\nKorytov, D., Hearin, A., Kovacs, E., et al. 2019,\ndoi: 10.3847/1538-4365/ab510c\nLaureijs, R., Gondoin, P., Duvet, L., et al. 2012, in Space\nTelescopes and Instrumentation 2012: Optical, Infrared,\nand Millimeter Wave, ed. M. C. Clampin, G. G. Fazio,\nH. A. MacEwen, & J. M. O. Jr., Vol. 8442, International\nSociety for Optics and Photonics (SPIE), 84420T,\ndoi: 10.1117/12.926496\nLIGO Scientific Collaboration. 2024.\nhttps://dcc.ligo.org/LIGO-T2300411/public\nMadau, P., & Dickinson, M. 2014, Annual Review of\nAstronomy and Astrophysics, 52, 415,\ndoi: 10.1146/annurev-astro-081811-125615\nMobasher, B., Dahlen, T., Ferguson, H. C., et al. 2015, The\nAstrophysical Journal, 808, 101,\ndoi: 10.1088/0004-637X/808/1/101\nMukherjee, S., & Dizgah, A. M. 2022, The Astrophysical\nJournal Letters, 937, L27, doi: 10.3847/2041-8213/ac903b\nNaveed, K., Turski, C., & Ghosh, A. 2025, Dark standard\nsiren cosmology with bright galaxy subsets.\nhttps://arxiv.org/abs/2505.11268\nNeijssel, C. J", " C., & Ghosh, A. 2025, Dark standard\nsiren cosmology with bright galaxy subsets.\nhttps://arxiv.org/abs/2505.11268\nNeijssel, C. J., Vigna-Gómez, A., Stevenson, S., et al. 2019,\nMonthly Notices of the Royal Astronomical Society, 490,\n3740, doi: 10.1093/mnras/stz2840\nPerna, G., Mastrogiovanni, S., & Ricciardone, A. 2024,\nInvestigating the impact of galaxies’ compact binary\nhosting probability for gravitational-wave cosmology,\ndoi: 10.1051/0004-6361/202450840\nPortegies Zwart, S. F., & Yungelson, L. R. 1998, Astronomy\nand Astrophysics, v. 332, p. 173-188 (1998), 332, 173\nPratten, G., García-Quirós, C., Colleoni, M., et al. 2021,\nPhys. Rev. D, 103, 104056,\ndoi: 10.1103/PhysRevD.103.104056\nRasio, F. A., & Shapiro, S. L. 1992, Astrophysical Journal,\nPart 1 (ISSN 0004-637X), vol. 401, no. 1, p. 226-245.,\n401, 226\nRauf, L., Howlett, C., Davis, T. M., & Lagos, C. D. P.\n2023, Monthly Notices of the Royal Astronomical\nSociety, 523, 5719, doi: 10.1093/mnras/stad1757\nSantoliquido, F., Mapelli, M., Giacobbo, N., Bouffanais, ", "the Royal Astronomical\nSociety, 523, 5719, doi: 10.1093/mnras/stad1757\nSantoliquido, F., Mapelli, M., Giacobbo, N., Bouffanais, Y.,\n& Artale, M. C. 2021, Monthly Notices of the Royal\nAstronomical Society, 502, 4877,\ndoi: 10.1093/mnras/stab280\nSchutz, B. F. 1986, Nature, 323, 310, doi: 10.1038/323310a0\nSrinivasan, R., Lamberts, A., Bizouard, M. A., Bruel, T., &\nMastrogiovanni, S. 2023, Monthly Notices of the Royal\nAstronomical Society, 524, 60,\ndoi: 10.1093/mnras/stad1825\nTallada, P., Carretero, J., Casals, J., et al. 2020, Astronomy\nand Computing, 32, 100391,\ndoi: 10.1016/j.ascom.2020.100391\nThe LIGO Scientific Collaboration and The Virgo\nCollaboration, The 1M2H Collaboration, The Dark\nEnergy Camera GW-EM Collaboration, the DES\nCollaboration, et al. 2017, Nature, 551, 85,\ndoi: 10.1038/nature24471\nTutukov, A. V., & YungelSon, L. R. 1993, Monthly Notices\nof the Royal Astronomical Society, 260, 675,\ndoi: 10.1093/mnras/260.3.675\nVijaykumar, A., Fishbach, M., Adhikari, S., & Holz, D. E.\n2024, The Astrophysical Jou", "ty, 260, 675,\ndoi: 10.1093/mnras/260.3.675\nVijaykumar, A., Fishbach, M., Adhikari, S., & Holz, D. E.\n2024, The Astrophysical Journal, 972, 157,\ndoi: 10.3847/1538-4357/ad6140\nWilliams, M. J., Veitch, J., & Messenger, C. 2021, Phys.\nRev. D, 103, 103006, doi: 10.1103/PhysRevD.103.103006\n17\nAPPENDIX\nA. EFFECT OF INCLUDING FAINTER GALAXIES\nFor our main results, we choose to cut MICECATv2 at r-band absolute magnitude -20. Here we perform a comparison\ntest that uses a mock catalogue by cutting MICECATv2 at r-band absolute magnitude -19 to test the effect of\nincluding fainter galaxies on our results. Here we define this cut as r-band absolute magnitude thresholdMth\nr = −19.\nThe distribution of galaxies on r-band absolute magnitude of MICECATv2 is shown in Fig.10 which is generated by\nCOSMOHUB (Korytov et al. 2019; Tallada et al. 2020). The distribution in Fig.10 peaks at around -19, meaning there\nare fainter galaxies missing at higher end of the redshift range. Thus, pushingMth\nr any further to the fainter end will\ni", "there\nare fainter galaxies missing at higher end of the redshift range. Thus, pushingMth\nr any further to the fainter end will\nintroduce a serious under-density of faint galaxies at high redshift.\nFigure 10.This is the distribution of galaxies on r-band absolute magnitude of MICECATv2. The distribution peak at around\n-20 because of a lack of faint galaxies at the higher end of the redshift range.\nAfter the luminosity cut, we randomly draw 10%, the same percentage with main results, from galaxies that passed\nthis threshold and assume that this sliced catalogue is complete. There are around 20.5 million galaxies used, more\nthan doubled compared to our main results which includes 9 million galaxies in total. This implies over half of the\n20.5 million galaxies should be faint galaxies with−19 < Mr < −20.\nThe full sky redshift prior of this catalogue is shown in Fig.11 and example LOS of a pixel is shown in Fig.12. Fig.11\nshows that at the uniform weighted redshift prior peaks at around redshift 1.1, which means t", "a pixel is shown in Fig.12. Fig.11\nshows that at the uniform weighted redshift prior peaks at around redshift 1.1, which means there is already slight\nunder-density of faint galaxies at high redshift at thisMth\nr . However, both r-band and g-band-weighted redshift priors\ndo not change significantly compared to Fig.6 because the faint galaxies are down-weighted. Fig.12 shows the LOS\nprior of the same pixel shown in Fig.3. We can roughly see that the difference between r-band weighting and uniform\nweighting is greater in Fig.12 than that in Fig.3. This is also because the faint galaxies added in theMth\nr = −19 are\ndown weighted by luminosity weighting while having the same weight with other galaxies in uniform weighting. Thus,\n18\nwe expect that by including fainter galaxies it would be easier to distinguish between the luminosity weighting models\nand the uniform weighting model.\nFigure 11. This is the full-sky redshift priors of MICECATv2 for r-band weighting, g-band weighting, and uniform weighting\nwhen the r-", " 11. This is the full-sky redshift priors of MICECATv2 for r-band weighting, g-band weighting, and uniform weighting\nwhen the r-band absolute magnitude cutMth\nr = −19. The uniform weighted prior goes down after redshift 1.1 while the r-band\nand g-band weighted priors do not have significant changes compared to Fig.6.\nWe then generate a∼1000 detection BBH population, Population 6, with the same population model with the main\nresults, injected into thisMth\nr = −19 catalogue based on r-band luminosity weighting. We then apply our host galaxy\nweighting model comparison analysis using Population 6.\nBayes factors r-band / g-band r-band / uniform weighting\nPopulation 4 (1151 detections),Mth\nr = −20 8.61 9.75 × 104\nPopulation 5 (1062 detections),Mth\nr = −20 1.76 1.55 × 103\nPopulation 6 (1053 detections),Mth\nr = −19 3.80 2.59 × 106\nTable 6.This table compares the Bayes factor results between Population 6 which is injected intoMth\nr = −19 catalogue, and\nPopulation 4 and 5 which are injected intoMth\nr = −20 catalogue. T", "Population 6 which is injected intoMth\nr = −19 catalogue, and\nPopulation 4 and 5 which are injected intoMth\nr = −20 catalogue. The Bayes factor of r-band versus uniform weighting for\nPopulation 6 significantly increased by2 ∼ 3 magnitude compared to Population 4 and 5.\nThe results of Population 6 compared to Population 4 and 5 are shown in Tab.6. There is a significant improvement\nin the Bayes factor comparing r-band and uniform weighting for Population 6 as expected, which increases by2 ∼ 3\nmagnitudes. As mentioned above, this is the result of the fact that fainter galaxies have the same weights with brighter\ngalaxies in uniform weighting but are down weighted by r-band/g-band luminosity weighting. The Bayes factor of\n19\nFigure 12. These are the LOS redshift priors at the same pixel in Fig.3. The left panel (a) compares r-band weighting versus\ng-band weighting while the right panel (b) compares r-band weighting and uniform weighting. There are more fainter galaxies\nincluded, as a results the differences amon", "(b) compares r-band weighting and uniform weighting. There are more fainter galaxies\nincluded, as a results the differences among the host galaxy weighting models increased compared to Fig.3.\nr-band over g-band for Population 6 is roughly in the same magnitude with Population 4 and 5, which is expected\nsince the low luminosity galaxies are down weighted by r-band and g-band weighting.\nOverall, we find that including fainter galaxies in our analysis will improve our Bayes factor model comparison\nanalysis for luminosity weighting versus uniform weighting. However, we still chooseMth\nr = −20 for our main results\nbecause it is volume limited, i.e. no under-density of faint galaxies at high redshift."]